IDEA Open Model
MatConcreteEc2.DiagramType Property
Compatible with IDEA StatiCa 20.1
 Type of stress-strain diagram bilinear/parabolic/general for ULS calculation
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public ConcDiagramType DiagramType { get; set; }
Public Property DiagramType As ConcDiagramType
	Get
	Set
Property Value
Type: ConcDiagramType
See Also
Reference
MatConcreteEc2 Class
IdeaRS.OpenModel.Material Namespace